# Brewfile for dotfiles
# Usage: brew bundle install

# Core tools
brew "zsh"
brew "git"
brew "tmux"

# Development tools
brew "mise"                 # Version manager (replaces nvm, pyenv, etc)
brew "fzf"                  # Fuzzy finder
brew "ripgrep"              # Fast grep
brew "bat"                  # Better cat
brew "tree"                 # Directory tree
brew "htop"                 # Process viewer
brew "tldr"                 # Simplified man pages
brew "httpie"               # HTTP client

# Build tools
brew "cmake"
brew "coreutils"
brew "gnu-sed"

# Code navigation
brew "ctags"
brew "global"
brew "ack"

# Utils
brew "asciinema"            # Terminal recorder
brew "shellcheck"           # Shell script linter

# Optional GUI apps (uncomment if needed)
# cask "iterm2"
# cask "visual-studio-code"
# cask "wireshark"
